app/extensions/activity/yii2-sports/web/controllers/DefaultController.php

    public function actionUserInfo()
    {
        $data = Yii::$app->request->get();
        $identification = $data['identification'];
        $openId = IdentifyController::Identification($identification);
        SportsUser::Register($data, $openId);
        //判断是否是当日首次进入
        $todayBegin = strtotime(date('Y-m-d') . " 00:00:00");
        $todayEnd = strtotime(date('Y-m-d') . " 23:59:59");
        $firstLogin = SportsLogin::find()->Where(['between', 'record_time', $todayBegin, $todayEnd])->andWhere(['record_user' => $openId])->one();
---
SELECT * FROM `tbl_sports_login` WHERE (`record_time` BETWEEN 1509638400 AND 1509724799) AND (`record_user`='oZJcc0WwhZWuLFfeN-ETjLOwvcxI')