app/extensions/activity/yii2-sports/models/SportsSign.php

SELECT * FROM `tbl_sports_sign` WHERE (`sign_time` BETWEEN 1509638400 AND 1509724799) AND (`sign_user`='oZJcc0WwhZWuLFfeN-ETjLOwvcxI')
---
    public static function IsSign($todayBegin, $todayEnd, $openId)
    {
        $result = static::find()->Where(['between', 'sign_time', $todayBegin, $todayEnd])->andWhere(['sign_user' => $openId])->one();

INSERT INTO `tbl_sports_sign` (`sign_day`, `sign_user`, `sign_time`, `updated_at`, `created_at`) VALUES (2, 'oZJcc0WwhZWuLFfeN-ETjLOwvcxI', 1509678223, 1509678223, 1509678223)
---
    public static function SignRecord($openId, $signDay)
    {
        $model = new SportsSign();
        $model->sign_day = $signDay;
        $model->sign_user = $openId;
        return $model->save() ? true : false;

SELECT * FROM `tbl_sports_sign` WHERE (`sign_time` BETWEEN 1509465600 AND 1511971200) AND (`sign_user`='oZJcc0WwhZWuLFfeN-ETjLOwvcxI') ORDER BY `sign_time` DESC
---
    public static function History($first_day, $last_day, $openId)
    {
        $history = static::find()->Where(['between', 'sign_time', $first_day, $last_day])->andWhere(['sign_user' => $openId])->orderBy(['sign_time' => SORT_DESC])->all();