app/extensions/activity/yii2-sports/models/SportsUser.php

    public static function UpdateScores($data, $status)
    {
        $identification = $data['identification'];
        $openId = substr($identification, 24);
        $userInfo = User::findIdentity($openId);
        if ($status == 0) {
            $userInfo->scores = ($userInfo->scores) + $data['score'];
        } else {
            $userInfo->scores = ($userInfo->scores) - $data['score'];
        }
        return $userInfo->save() ? true : false;
---
UPDATE `tbl_sports_user` SET `scores`=9, `updated_at`=1509678223 WHERE `id`=2