app/extensions/activity/yii2-sports/models/SportsScores.php

    public static function RecodeScores($data, $status, $score_rules = '')
    {
        $score_rules = isset($data['score_rules']) ? $data['score_rules'] : $score_rules;
        $model = new SportsScores();
        $identification = $data['identification'];
        $openId = User::Identification($identification);
        $model->score_status = $status;
        $model->user_id = $openId;
        $model->score_value = $data['score'];
        $model->score_rules = $score_rules;
        return $model->save() ? true : false;
---
INSERT INTO `tbl_sports_scores` (`score_status`, `user_id`, `score_value`, `score_rules`, `created_at`, `updated_at`, `score_time`) VALUES (0, 'oZJcc0WwhZWuLFfeN-ETjLOwvcxI', 5, 'Sign', 1509678223, 1509678223, 1509678223)